TD_simd/td.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-16 Mon 19:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>TD SIMD</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">TD SIMD</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga817902">1. Introduction</a></li>
<li><a href="#org8b145bd">2. Travail a effectuer</a>
<ul>
<li><a href="#org27f7245">2.1. Code</a></li>
<li><a href="#org0f2d3d3">2.2. Options de compilation</a></li>
</ul>
</li>
<li><a href="#orgb5e032f">3. Rendu</a></li>
<li><a href="#org7582eb5">4. References:</a></li>
</ul>
</div>
</div>
<p>
<span class="underline">Directives</span>:
</p>

<ul class="org-ul">
<li>Ce TD sera a rendre pour au plus tard Dimanche 00:00 (minuit) sur mon courriel UVSQ: <i>mohammed-salah.ibnamar@uvsq.fr</i> avec comme objet: <b><code>[AP TD_simd - NOM PRENOM]</code></b></li>
</ul>

<p>
<span class="underline">Notes</span>:
</p>

<ul class="org-ul">
<li>Vous pouvez effectuer votre exploration sur une VM car l'execution du code n'est pas importante.</li>
<li>Evitez de copier du code, je le verrai tres rapidement :)</li>
</ul>

<div id="outline-container-orga817902" class="outline-2">
<h2 id="orga817902"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
L'objectif de ce TD est d'explorer le jeu d'instructions SIMD present 
sur les processeurs x86 (Intel et AMD) dont vous disposez.
</p>
</div>
</div>

<div id="outline-container-org8b145bd" class="outline-2">
<h2 id="org8b145bd"><span class="section-number-2">2</span> Travail a effectuer</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org27f7245" class="outline-3">
<h3 id="org27f7245"><span class="section-number-3">2.1</span> Code</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Vous devez implementer plusieurs versions du code <b>dotprod</b> ci-dessous en deroulant autant de fois 
que vous desirez la boucle interne et comparer les codes assembleurs produits par le compilateur 
pour les differentes versions avec differentes options de compilation.
</p>

<div class="org-src-container">
<pre class="src src-c">
<span style="color: #98f5ff;">double</span> <span style="color: #daa520;">dotprod</span>(<span style="color: #98f5ff;">double</span> *<span style="color: #00bfff;">restrict</span> <span style="color: #4eee94;">a</span>, <span style="color: #98f5ff;">double</span> *<span style="color: #00bfff;">restrict</span> <span style="color: #4eee94;">b</span>, <span style="color: #98f5ff;">unsigned</span> <span style="color: #98f5ff;">long</span> <span style="color: #98f5ff;">long</span> <span style="color: #4eee94;">n</span>)
{
    <span style="color: #98f5ff;">double</span> <span style="color: #4eee94;">d</span> = 0.0;

    <span style="color: #00bfff;">for</span> (<span style="color: #98f5ff;">unsigned</span> <span style="color: #98f5ff;">long</span> <span style="color: #98f5ff;">long</span> <span style="color: #4eee94;">i</span> = 0; i &lt; n; i++)
       d += a[i] * b[i];

    <span style="color: #00bfff;">return</span> d;
}

</pre>
</div>
</div>
</div>

<div id="outline-container-org0f2d3d3" class="outline-3">
<h3 id="org0f2d3d3"><span class="section-number-3">2.2</span> Options de compilation</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<span class="underline">Vous pouvez utiliser un ou plusieurs compilateurs, par exemple</span>: 
</p>

<ul class="org-ul">
<li>GNU C Compiler <b>gcc</b></li>
<li>Intel C Compiler <b>icc</b></li>
<li>LLVM <b>clang</b></li>
<li>AMD Optimizing C Compiler <b>aocc</b>.</li>
</ul>

<p>
<span class="underline">Il faudra compiler le programme en suivant les etapes suivantes (pour <b>gcc</b> et <b>clang</b>)</span>:
</p>

<ul class="org-ul">
<li><span class="underline">Version de base</span>: -O1</li>
<li><span class="underline">Version legerement optimisee</span>: -O2</li>
<li><span class="underline">Version optimisee</span>: -O3</li>
<li><span class="underline">Version fortement optimisee</span>: -Ofast</li>
<li><span class="underline">Version kamikaze</span>: -march=native -mtune=native -Ofast -funroll-loops -finline-functions -flto -ftree-vectorize</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgb5e032f" class="outline-2">
<h2 id="orgb5e032f"><span class="section-number-2">3</span> Rendu</h2>
<div class="outline-text-2" id="text-3">
<p>
Vous devez fournir une archive contenant les codes sources et les codes assembleurs analyses en plus d'un <b>README</b> qui fournit
des explications pour chacune des versions de la fonction et si les instructions SIMD x86 (jeux d'instructions SSE et AVX) ont ete 
utilisees de facon scalaire (i.e. add[sd] ou add[ss]) ou vectorielle (i.e. add[pd] ou add[ps]).
</p>

<ul class="org-ul">
<li>[ss | sd]: <b>ss</b> pour <b>scalar</b> <b>simple</b> precision et <b>sd</b> pour <b>scalar</b> <b>double</b> precision</li>
<li>[ps | pd]: <b>ps</b> pour <b>packed</b> <b>simple</b> precision et <b>pd</b> pour <b>packed</b> <b>double</b> precision</li>
</ul>

<p>
Il est preferable de creer un <b>makefile</b> avec une regle par version.
</p>

<p>
Il faudra aussi fournir un fichier contenant la version du compilateur utilise:
</p>

<div class="org-src-container">
<pre class="src src-bash">
<span style="color: #7f7f7f;">#</span><span style="color: #7f7f7f;">Pour GCC</span>
$ gcc --version &gt; gcc_ver.txt

<span style="color: #7f7f7f;">#</span><span style="color: #7f7f7f;">Pour clang</span>
$ clang --version &gt; clang_ver.txt

</pre>
</div>

<p>
Et un fichier contenant les informations sur votre processeur:
</p>

<div class="org-src-container">
<pre class="src src-bash">
$ cat /proc/cpuinfo &gt; cpuinfo.txt

</pre>
</div>
</div>
</div>

<div id="outline-container-org7582eb5" class="outline-2">
<h2 id="org7582eb5"><span class="section-number-2">4</span> References:</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><span class="underline">RTFM</span>: man gcc</li>

<li><a href="https://gcc.godbolt.org/">https://gcc.godbolt.org/</a></li>
<li><a href="https://software.intel.com/sites/landingpage/IntrinsicsGuide/">https://software.intel.com/sites/landingpage/IntrinsicsGuide/</a></li>
<li><a href="https://gcc.gnu.org/onlinedocs/gcc/Optimize-Options.html">https://gcc.gnu.org/onlinedocs/gcc/Optimize-Options.html</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2020-11-16 Mon 19:35</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
